package LeetCode数据结构与算法基础.动态规划;

import java.util.Arrays;
import java.util.Scanner;

/**
 * @author by KingOfTetris
 * @date 2023/9/19
 *
 *
 * 给定一个数组，它的第 i 个元素是一支给定的股票在第 i 天的价格。
 *
 * 设计一个算法来计算你所能获取的最大利润。你最多可以完成 两笔 交易。
 *
 * 注意：你不能同时参与多笔交易（你必须在再次购买前出售掉之前的股票）。
 *
 *
 *
 * 示例 1:
 *
 * 输入：prices = [3,3,5,0,0,3,1,4]
 * 输出：6
 * 解释：在第 4 天（股票价格 = 0）的时候买入，在第 6 天（股票价格 = 3）的时候卖出，这笔交易所能获得利润 = 3-0 = 3 。
 *      随后，在第 7 天（股票价格 = 1）的时候买入，在第 8 天 （股票价格 = 4）的时候卖出，这笔交易所能获得利润 = 4-1 = 3 。
 * 示例 2：
 *
 * 输入：prices = [1,2,3,4,5]
 * 输出：4
 * 解释：在第 1 天（股票价格 = 1）的时候买入，在第 5 天 （股票价格 = 5）的时候卖出, 这笔交易所能获得利润 = 5-1 = 4 。
 *      注意你不能在第 1 天和第 2 天接连购买股票，之后再将它们卖出。
 *      因为这样属于同时参与了多笔交易，你必须在再次购买前出售掉之前的股票。
 * 示例 3：
 *
 * 输入：prices = [7,6,4,3,1]
 * 输出：0
 * 解释：在这个情况下, 没有交易完成, 所以最大利润为 0。
 * 示例 4：
 *
 * 输入：prices = [1]
 * 输出：0
 *
 *
 * 提示：
 *
 * 1 <= prices.length <= 105
 * 0 <= prices[i] <= 105
 */


///III 就是正儿八经的DP了。
//只能买卖两次。而且每只股票只能买一次。

public class 买卖股票的最佳时机III {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int n = sc.nextInt();
        int[] nums = new int[n];
        for (int i = 0; i < n; i++) {
            nums[i] = sc.nextInt();
        }
        int res = solution(nums);
        System.out.println(res);
    }

    private static int solution(int[] prices) {
        //对一个股票可以有两次操作，买入卖出。
        //同一天，你只能买一只股票，或者卖一只股票。
        //也就是说，比如 1 2 8 这种股票
        //你不能第一天买入1，第二天买入2，然后第三天一起卖掉赚13
        //只能第一天买，第三天卖。赚7
        //或者你第2天卖，第三天卖，赚6

        /**
         * 代码随想录DP方式，两次买卖
         * 1.首先 我们定义dp数组
         *
         * 确定dp数组以及下标的含义
         * 一天一共就有五个状态，
         *
         * dp[i][0]没有操作 （其实我们也可以不设置这个状态）
         * dp[i][1]第一次持有股票
         * dp[i][2]第一次不持有股票
         * dp[i][3]第二次持有股票
         * dp[i][4]第二次不持有股票
         * dp[i][j]中 i表示第i天，j为 [0 - 4] 五个状态，dp[i][j]表示第i天状态j所剩最大现金。
         *
         *
         */

        /**
         * 2.确定递推公式
         * 达到dp[i][1]状态，有两个具体操作：
         *
         * 昨天没买入股票，那么今天去买： dp[i-1][0](当前手里有的钱) - prices[i]
         * 昨天已经持有，延续昨天的持有状态：  dp[i-1][1]
         *
         * 那么去选最大的 dp[i][1] = max(dp[i-1][0] - prices[i], dp[i - 1][1]);
         *
         *  dp[i][2] 表示第一次不持有
         *
         * 昨天持有，但是我今天卖掉，保存不持有状态
         * dp[i][2] = dp[i - 1][1] + prices[i]  注意卖掉是 + 当前price
         *
         * 延续昨天不持有的状态  dp[i][2] = dp[i - 1][2]
         * 还是取最大 dp[i][2] = max(dp[i - 1][1] + prices[i], dp[i - 1][2])
         *
         * 同理可推出剩下状态部分：
         *
         * dp[i][3] = max(dp[i - 1][3], dp[i - 1][2] - prices[i]);
         *
         * dp[i][4] = max(dp[i - 1][4], dp[i - 1][3] + prices[i]);
         */

        /**
         * dp数组如何初始化
         * 第0天没有操作，这个最容易想到，就是0，即：dp[0][0] = 0;
         *
         * 第0天做第一次买入的操作，dp[0][1] = -prices[0];
         *
         * 第0天做第一次卖出的操作，这个初始值应该是多少呢？
         *
         * 此时还没有买入，怎么就卖出呢？ 其实大家可以理解当天买入，当天卖出，所以dp[0][2] = 0;
         *
         * 第0天第二次买入操作，初始值应该是多少呢？应该不少同学疑惑，第一次还没买入呢，怎么初始化第二次买入呢？
         *
         * 第二次买入依赖于第一次卖出的状态，其实相当于第0天第一次买入了，第一次卖出了，
         * 然后再买入一次（第二次买入），那么现在手头上没有现金，只要买入，现金就做相应的减少。
         *
         * 所以第二次买入操作，初始化为：dp[0][3] = -prices[0];
         *
         * 同理第二次卖出初始化dp[0][4] = 0;
         */

        /**
         * 确定遍历顺序
         * 从递归公式其实已经可以看出，一定是从前向后遍历，因为dp[i]，依靠dp[i - 1]的数值。
         *
         * 举例推导dp数组
         * 以输入[1,2,3,4,5]为例
         */

        int len = prices.length;
        // 边界判断, 题目中 length >= 1, 所以可省去
        if (prices.length == 0) return 0;

        /*
         * 定义 5 种状态:
         * 0: 没有操作, 1: 第一次买入, 2: 第一次卖出, 3: 第二次买入, 4: 第二次卖出
         */
        int[][] dp = new int[len][5];
        dp[0][0] = 0;
        dp[0][1] = -prices[0];
        dp[0][2] = 0;
        // 初始化第二次买入的状态是确保 最后结果是最多两次买卖的最大利润
        //当天买当天卖，那么他的买入价格还是 -price[0]
        dp[0][3] = -prices[0];
        dp[0][4]= 0;

        for (int i = 1; i < len; i++) {
            //第一次持有，要么延续上一次持有的状态，或者买入今日股票
            dp[i][1] = Math.max(dp[i - 1][1], -prices[i]);
            //第一次不持有，要么延续上一次不持有状态，或者卖出手里的股票。
            dp[i][2] = Math.max(dp[i - 1][2], dp[i - 1][1] + prices[i]);

            //下面这两个也是同理。
            dp[i][3] = Math.max(dp[i - 1][3], dp[i - 1][2] - prices[i]);
            dp[i][4] = Math.max(dp[i - 1][4], dp[i - 1][3] + prices[i]);
        }
        System.out.println(Arrays.deepToString(dp));
        //最后返回最后一天卖出2支股票的状态就可以了。
        return dp[len - 1][4];

        //这样写确实比较麻烦，但是为了引出IV,K次买卖股票。
    }
}
