package 十大排序;

/**
 * @author by KingOfTetris
 * @date 2022/9/6
 * 基数排序
 */
public class radixsort {
    /**
     * 一种多关键字的排序算法，可用桶排序实现。
     * 算法思想：
     * 先按个位上的数字从0-9排，排完后获得新的顺序，然后继续按十位上的数0-9排，继续获得新的顺序..
     * 依次类推，直到没有新的位可以排。
     *
     * 取得数组中的最大数，并取得位数；
     * arr为原始数组，从最低位开始取每个位组成radix数组；
     * 对radix进行计数排序（利用计数排序适用于小范围数的特点）
     */

    /**
     * 1、设待排序列为n个记录，k个桶，关键码的取值范围为radix 基数排序时间复杂度为O(k(n+radix))，
     * k 表示桶的个数
     * 实际大规模的排序中d是非常大的！所以表面上是O(n) 实际上接近O(n^2)
     * 因此不快于基于比较的排序算法（如快速排序、堆排序等）。
     * 2、十进制基数位10，二进制基数位2。
     * 3、当元素取值范围较大，但元素个数较少时可以利用基数排序。
     */
}
