package 校招笔试真题.蚂蚁金服._20240825;

import java.util.*;

/**
 * 如果在括号序列中插入字符
 * +
 * +和
 * 1
 * 1就可以得到正确的算术表达式，那么这个括号序列就称为合法的括号序列。
 *
 * 例如，"”、"(())"和"()()"是合法的括号序列，因为填入内容后可以表示为((1))和(1)+(1)，这都是合法的。
 * 现在塔子哥有
 * a个"(("，
 * b个"))"，
 * c个"()"，
 * d个")("。
 * 塔子哥想知道能否将这些括号串连成一个合法的括号序列。
 * 你可以阅读样例解释获得更多信息。
 *
 * 输入描述
 * 每个测试文件均包含多组测试数据。
 *
 * 第一行输入一个整数T(1≤<T≤10^5)代表数据组数，每组测试数据描述如下：
 *
 * 在一行上输入四个整数a,b,c,d(0≤a,b,c,d≤10^9)代表塔子哥的括号序列。
 *
 * 输出描述
 * 对于每组数据，如果能够将这些括号串连成一个合法的括号序列，在一行上输出YES ，否则输出NO。
 *
 * 示例1
 * 输入
 *
 * 2
 * 1 1 1 1
 * 1 2 1 1
 * 输出
 *
 * YES
 * NO
 * 说明
 *
 * 对于第一组测试数据，可以按照如下顺序拼接"(("+")("+"))"+"()”，填入内容后可以表示为((1)+(1))+(1)，
 * 这是一个合法的括号序列。
 */
public class 括号序列 {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int T = sc.nextInt();
        while (T-- > 0) {
            int a = sc.nextInt(), b = sc.nextInt();
            int c = sc.nextInt(), d = sc.nextInt();

            //为什么首要条件判断是d > 0 且 a == 0?
            // a个((   d个)(
            //
            if (d > 0 && a == 0) {
                System.out.println("NO");
            } else if (a != b) {
                System.out.println("NO");
            } else {
                System.out.println("YES");
            }
        }
    }
}
